{"meta":{"title":"编程训练营","subtitle":"Scratch编程 Ardunio机器人搭建 Python自动化","description":"点点滴滴在编程","author":"王俊杰","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"全国青少年机器人技术等级考试---秋千","slug":"技术等级考试/第二章秋千","date":"2018-11-08T02:36:11.036Z","updated":"2018-11-08T02:36:11.036Z","comments":true,"path":"2018/11/08/技术等级考试/第二章秋千/","link":"","permalink":"http://yoursite.com/2018/11/08/技术等级考试/第二章秋千/","excerpt":"","text":"考试安排如下，详询瓦力工厂工作人员！秋千是一种运动器具，或者是游戏用具，我们在公园、学校、或者社区都能看到。小朋友坐在座椅上，由他人推动或自己的脚用力，人随座椅来回摆动。 秋千的起源说起秋千可以追溯到几十万年前的上古时代。那是我们的祖先为了谋生，需要上树采摘野果或猎取野兽。在攀援和奔跑中，他们抓住粗壮的蔓生植物。依靠藤条的摇荡摆动，上树或跨越沟涧，这应该是秋千的原始雏形。春秋时期，我国北方有了将绳索悬挂于木架下，下面装上踏板的秋千。如今公园，社区处处可见秋千，认真观察秋千会发现，一般来说秋千的支架两边都是由三角形构成的。那么，为什么秋千的支架都是三角形的呢？用长条和螺丝分别制作出三角形和四边形，用手推动一个角。会发现有什么变化吗？ 实验证明三角形结构和稳定，不会形变而四边形结构在一定力量的挤压下会发生形变。根据三角形和四边形的特性，想一想生活中哪些地方应用到了三角形和四边形呢？金字塔、房子、吊车等需要稳定的结构中都用到了三角形，而在拉伸门等需要变形的结构中，则用到了四边形。 制作秋千通常有框架和底座组成，我们也按照这样的组成来自坐秋千。1.制作秋千的框架。这需要两个稳定的三角形结构。秋千的底座完成整个秋千利用一个圆轴将座椅装在支架上。 ###稳定性分析每个物体都是由简单的图形构成的，也就是说物体的每个面都是由圆、三角形，四边形和多边形构成的。三角形有着稳固、耐压的特点，三角形框架，起重机，三角形吊臂，屋顶，钢架桥中都有三角形的身影。三角形稳定性分析：任取三角形两条边在两条边角度不变的情况下，在两条边的非公共端点连接第三条边。因为第三条边不可伸缩和只弯折，所以两端点距离固定，按照相同的方式任取两条边都符合上述情况。所以三角形固定具有稳定性。 一个结构是否稳定，除了考虑结构外，还要考虑放置的位置和物体的重心。总体来说，要符合一下原则 1.与地面接触面积越大，物体越稳。 2.重心越低，物体越稳。￼3.通过重心做竖直向下的直线与地面的交点，如果在接触面上，则物体较稳，如果在接触面外物体不稳. 能量转化一切物质都具有能量，能量由以多种不同的形式存在。按照物质的不同运动形式分类，能量可分为机械能，化学能，热能，电能，辐射能，核能，光能，潮汐能等。这些不同形式的能量之间可以通过物理效应和化学反应而相互转化。￼秋千中涉及的能量转化是动能和势能之间的转化。动能是物体在运动时具有的能。￼势能包括重力势能和弹性势能，重力势能是物体由于被举高而产生的能量，弹性势能是物体由于弹性形变而产生的能量。机械能是动能和势能的总和，两者之间的转化关系当物体下落时，高度越小，那么它的重力势能就越来越小，但是物体的速度会越来越快，动能也就越来越大，如果不考虑空气阻力的话，机械能是不变的重力势能减小的部分就变成了动能。在荡秋千时，从最低点到最高点的过程中，速度越来越小，而高度越来越大，这时动能转化为重力势能当达到最高点时速度为零，动能为零，全部能量转化为重力势能从最高点下降到最低点的过程中，速度越来越大，而高度越来越小，这时重力势能转化为动能。到达最低点时速度最大，动能最大，重力势能最小。能量守恒，能量不会凭空消失，也不会凭空产生，它只会从一种形式转化为其他形式，或者从一个物体转移到另一个物体，而在转化和转移的过程中，能量的总和保持不变。 能量守恒：能量不会凭空消失，也不会凭空产生，它只会从一种形式转化为其他形式，或者从一个物体转移到另一个物体，而在转化和转移的过程中，能量的总和保持不变。 单摆玩秋千的时候我们可能会发现秋千摆动的幅度越来越小，但摆动一周的时间却没有跟着变短。时间始终是差不多的，这是为什么呢？因为秋千是一个近似的单摆运动（单摆是摆动角度小于100的小幅摆动）。单摆运动的周期T和摆动的幅度以及小朋友的重量无关，而与单摆的长度L（秋千绳索的长度）和重力加速度有关（如果只在地球上进行单摆运动的话，可以认为系也是一个常量）单摆周期公式： 现在人们公认是伽利略发现了单摆的等时性原理，伽利略在比萨教堂里注意到一盏悬灯的摆动，随后用线悬铜球做模拟实验，验证了微小百度的灯时星以及摆长对周期的影响，因此创造出脉搏计用来测量短时间间隔。￼尽管在伽利略之前的好几个世纪等时性早已经为阿拉伯人所熟知，但以科学的态度去研究这一现象的科学家还是首推伽利略。虽然伽利略在1602年注意到了单摆运动，当时他误认为单摆在大摆动条件下也成立。而最早系统地研究单摆的是惠更斯，并且开始用无穷小的机和方法推导出了钟摆的周期公式。","categories":[],"tags":[]},{"title":"全国青少年机器人技术等级考试---基本结构","slug":"技术等级考试/第二章基秋千","date":"2018-11-07T06:12:03.994Z","updated":"2018-11-07T06:12:03.994Z","comments":true,"path":"2018/11/07/技术等级考试/第二章基秋千/","link":"","permalink":"http://yoursite.com/2018/11/07/技术等级考试/第二章基秋千/","excerpt":"","text":"考试安排如下，详询瓦力工厂工作人员！ 结构体在很久很久以前，当人们想要过河的时候，会在河的两岸搭一根树干。不过树干搭建的乔并不一定结实，如果树干不够粗的话，很容易在中间断开当人们需要躲避风雨的时候会躲进山洞里，但山洞也不一定安全，里面通常住着凶猛的怪兽。所以就在生活中有目的地搭建一些结构，这种为了实现某种功能而建造的物体叫做结构体，结构体通常是多个物品的连接。 钉子钉子是我们生活中最常见的连接零件，外观如下：钉子指的是尖头状的圆形硬金属(通常是钢)，通常作为固定木头等物用。 螺丝目前在生活中连接时使用最多的是螺丝。螺丝是利用其身上的斜面旋转纹路，通过旋转的形式，循序渐进地进入被固定件中的。在国定物体时，能够在省力的前提下有效的提高安全性，另外如果我们反方向旋转螺丝的话，还能够完好的将螺丝拆下来，并再次将其使用到其他地方。螺丝是一种通称，可大体的分为螺丝钉与螺丝杆，螺丝钉一般叫做木螺丝，他和钉子有点像，只是螺丝的杆身上有螺旋状的纹路，一般用于紧固木板与塑料件。相对于螺丝钉的另一种螺丝是螺丝杆，螺丝杆也叫机螺丝，螺丝杆前端是平头的，通常用来紧固金属机械部件。除了螺丝，图中还有一个六边形的零件叫做螺母，螺丝杆与螺母是配套使用的，螺母的内部有螺旋状的纹路，能够通过旋转固定在螺丝上。 楔和螺旋钉子和螺丝上其实包含了两种最基本的结构–楔和螺旋。楔形是斜面的应用，原指上厚下薄的小木橛，在结构上表示一头尖，一头稍粗的物品。钉子相当于圆柱形的楔形。最早的记录出现在15世纪，当时的木匠们使用木钉或金属钉子把家具和木结构的建筑物连接起来。16世纪时，欧洲最早出现了金属螺母和螺丝。制钉工人开始生产带纹路线的钉子，这些钉子能够更牢固地连接东西。那是从钉子到螺丝钉所跨出的一小步。 钉子上的这种纹路叫螺旋，第一个描述螺旋的人是希腊科学家阿基米德。阿基米德螺旋是一个装在木制圆筒里的巨大螺旋物。它用来把水从一个水平提升到另一个水平，对田地进行灌溉。阿基米德螺旋的发明者并非阿基米德本人，他只是描述了这种已经存在的东西。阿基米德螺旋可能是由古代埃及的能工巧匠们设计并在尼罗河两岸灌溉中使用的。 螺丝刀与扳手在尝试拧螺丝的时候，大家可能发现虽然拧螺丝非常省力，不过，将螺丝和螺母拧紧也不太容易。要想将螺丝和螺母固定紧并需要依靠工具。钉钉子时需要使用的工具是锤子，而拧螺丝需要的工具叫螺丝刀。螺丝刀在1870年前后出现于伦敦。当时工匠们发现，用螺丝刀旋紧螺丝比用锤子敲击，能把东西固定的更好，尤其使用细纹螺丝时。最开始使用的螺丝刀都是一字螺丝刀，1936年，亨利.M.飞利浦为十字头钉槽头螺丝申请了专利，同时制造了十字螺丝刀。与传统一字槽钉头螺丝不同，十字头钉头螺丝在使用螺丝刀时会自动居中，不易滑落，因此深受欢迎。而固定螺母的工具叫扳手，扳手上有一个与螺母外形一样的开口，用来卡住螺母。扳手用到了杠杆原理，我们稍后再作介绍。","categories":[],"tags":[]},{"title":"全国青少年机器人技术等级考试---基本结构","slug":"技术等级考试/第一章基本结构","date":"2018-11-07T04:00:14.784Z","updated":"2018-11-07T04:00:14.784Z","comments":true,"path":"2018/11/07/技术等级考试/第一章基本结构/","link":"","permalink":"http://yoursite.com/2018/11/07/技术等级考试/第一章基本结构/","excerpt":"","text":"考试安排如下，详询瓦力工厂工作人员！ 结构体在很久很久以前，当人们想要过河的时候，会在河的两岸搭一根树干。不过树干搭建的乔并不一定结实，如果树干不够粗的话，很容易在中间断开当人们需要躲避风雨的时候会躲进山洞里，但山洞也不一定安全，里面通常住着凶猛的怪兽。所以就在生活中有目的地搭建一些结构，这种为了实现某种功能而建造的物体叫做结构体，结构体通常是多个物品的连接。 钉子钉子是我们生活中最常见的连接零件，外观如下：钉子指的是尖头状的圆形硬金属(通常是钢)，通常作为固定木头等物用。 螺丝目前在生活中连接时使用最多的是螺丝。螺丝是利用其身上的斜面旋转纹路，通过旋转的形式，循序渐进地进入被固定件中的。在国定物体时，能够在省力的前提下有效的提高安全性，另外如果我们反方向旋转螺丝的话，还能够完好的将螺丝拆下来，并再次将其使用到其他地方。螺丝是一种通称，可大体的分为螺丝钉与螺丝杆，螺丝钉一般叫做木螺丝，他和钉子有点像，只是螺丝的杆身上有螺旋状的纹路，一般用于紧固木板与塑料件。相对于螺丝钉的另一种螺丝是螺丝杆，螺丝杆也叫机螺丝，螺丝杆前端是平头的，通常用来紧固金属机械部件。除了螺丝，图中还有一个六边形的零件叫做螺母，螺丝杆与螺母是配套使用的，螺母的内部有螺旋状的纹路，能够通过旋转固定在螺丝上。 楔和螺旋钉子和螺丝上其实包含了两种最基本的结构–楔和螺旋。楔形是斜面的应用，原指上厚下薄的小木橛，在结构上表示一头尖，一头稍粗的物品。钉子相当于圆柱形的楔形。最早的记录出现在15世纪，当时的木匠们使用木钉或金属钉子把家具和木结构的建筑物连接起来。16世纪时，欧洲最早出现了金属螺母和螺丝。制钉工人开始生产带纹路线的钉子，这些钉子能够更牢固地连接东西。那是从钉子到螺丝钉所跨出的一小步。 钉子上的这种纹路叫螺旋，第一个描述螺旋的人是希腊科学家阿基米德。阿基米德螺旋是一个装在木制圆筒里的巨大螺旋物。它用来把水从一个水平提升到另一个水平，对田地进行灌溉。阿基米德螺旋的发明者并非阿基米德本人，他只是描述了这种已经存在的东西。阿基米德螺旋可能是由古代埃及的能工巧匠们设计并在尼罗河两岸灌溉中使用的。 螺丝刀与扳手在尝试拧螺丝的时候，大家可能发现虽然拧螺丝非常省力，不过，将螺丝和螺母拧紧也不太容易。要想将螺丝和螺母固定紧并需要依靠工具。钉钉子时需要使用的工具是锤子，而拧螺丝需要的工具叫螺丝刀。螺丝刀在1870年前后出现于伦敦。当时工匠们发现，用螺丝刀旋紧螺丝比用锤子敲击，能把东西固定的更好，尤其使用细纹螺丝时。最开始使用的螺丝刀都是一字螺丝刀，1936年，亨利.M.飞利浦为十字头钉槽头螺丝申请了专利，同时制造了十字螺丝刀。与传统一字槽钉头螺丝不同，十字头钉头螺丝在使用螺丝刀时会自动居中，不易滑落，因此深受欢迎。而固定","categories":[],"tags":[]},{"title":"全国青少年机器人技术等级考试---一级模拟试题","slug":"技术等级考试/全国青少年机器人技术等级考试---一级模拟试题","date":"2018-11-06T10:27:21.996Z","updated":"2018-11-06T10:27:21.996Z","comments":true,"path":"2018/11/06/技术等级考试/全国青少年机器人技术等级考试---一级模拟试题/","link":"","permalink":"http://yoursite.com/2018/11/06/技术等级考试/全国青少年机器人技术等级考试---一级模拟试题/","excerpt":"","text":"考试安排如下，详询瓦力工厂工作人员！ 2019年全国青少年机器人技术等级考试","categories":[],"tags":[]},{"title":"装甲车机器人","slug":"瓦力工厂/装甲车机器人","date":"2018-11-04T08:40:23.986Z","updated":"2018-11-04T08:40:23.986Z","comments":true,"path":"2018/11/04/瓦力工厂/装甲车机器人/","link":"","permalink":"http://yoursite.com/2018/11/04/瓦力工厂/装甲车机器人/","excerpt":"","text":"情景任务:瓦力工程师接到一个新任务，就是为“国防部”设计装甲车。来满足国防和维稳中用装甲车反坦克、扫雷、通讯和反恐的需要。现在要求制作发射导弹的装甲车，导弹发射时的角度可以自由调整。 任务分解：１．需要外界能量提供动力２．需要有轮子（为什么呢？观察生活）３．需要有前进、加速、减速、停止、转弯、后退的控制方法４．需要有装甲车的形状、特点。5.调整发射角度，利用马达导杆，控制发射角度。 知识点拓展：装甲车是具有装甲防护的各种履带或轮式军用车辆，是装有装甲的军用或警用车辆的统称。坦克也是装甲车履带式装甲车辆的一种，但是在习惯上通常因作战用途另外独立分类，而装甲车辆多半是指防护力与火力较坦克弱的车种。装甲车的特性为具有高度的越野机动性能，有一定的防护和火力作用，分为履带式和轮式两种，一般装备一至两门中小口径火炮及数挺机枪，一些还装有反坦克导弹，结构以装甲车体、武器系统、动力装置等组成。 器材分解：电池盒、轮子、CPU、触碰开光、LED灯、蜂鸣器，伺服马达，导杆系统 学习目标：1.三个马达的控制方法2.了解装甲车的基础知识。3.了解导杆系统在控制系统角度方面的应用。 构建步骤： 装甲车机器人程序设计：装甲车机器人，有什么疑问，加老师微信进行咨询吧！","categories":[],"tags":[]},{"title":"滑板车机器人","slug":"瓦力工厂/滑板车机器人","date":"2018-11-03T02:17:46.854Z","updated":"2018-11-03T02:17:46.854Z","comments":true,"path":"2018/11/03/瓦力工厂/滑板车机器人/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/滑板车机器人/","excerpt":"","text":"情景任务:瓦力工程师接到一个新任务，就是为“最后一公里”设计机器人。“最后一公里”指的是人们在上下学或上下班的途中，乘坐公共交通工具到达公交站，地铁站后，还需要走最后一公里才能达到目的地。作为瓦力工程师的我们怎么设计滑板车机器人，来帮助人们更方便的完成最后一公里呢？ 任务分解：１．需要外界能量提供动力２．需要有轮子（为什么呢？观察生活）３．需要有前进、加速、减速、停止、转弯、后退？的控制方法４．需要有声光指示、装饰 知识点拓展：平衡车原理：当我们在驾驶平衡车的时候，平衡车的两个轮子就代替了双脚。与身体的平衡系统非常类似，当我们的重心前倾时，智能系统就会自动感应到，并精确地驱动轮子向前运动，以保持平衡;同样地，当我们身体的重心后倾时，轮子就会向后运动。这套工作原理被称为“动态平衡”原理，这也是平衡车被叫做“平衡车”的原因，采用第二代运动补偿算法，利用其内部的陀螺仪和加速度传感器，来精确检测车体姿态的微小变化，并利用精密的伺服控制系统，灵敏地驱动电机，进行相应的调整，以保持整个车体的稳定和平衡。 器材分解：电池盒、轮子、CPU、触碰开光、LED灯、蜂鸣器 学习目标：1.复习触碰开关的工作原理。2.了解人们的代步工具。3.熟练运用循环模块（While）进行输入、输出控制。 构建步骤： 程序设计：","categories":[],"tags":[]},{"title":"保险杠机器人","slug":"瓦力工厂/保险杠机器人","date":"2018-11-03T01:27:31.641Z","updated":"2018-11-03T01:27:31.641Z","comments":true,"path":"2018/11/03/瓦力工厂/保险杠机器人/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/保险杠机器人/","excerpt":"","text":"情景任务:瓦力探险队在中国西部发现了一个很大的地下洞穴,但由于不清楚洞穴中是否有毒气,因此需要一个探测机器人进入洞穴进行探测,只能靠机器人自己在洞穴中躲避障碍物。现在，瓦力探险队把这个难题抛给瓦力工程师，作为瓦力工程师的我们，我们有责任和义务帮助瓦力探险队尽快设计出这种探测机器人任务","categories":[],"tags":[]},{"title":"趣味编程第1课-小猫学步","slug":"瓦力工厂/第1课小猫学步","date":"2018-11-03T01:14:28.495Z","updated":"2018-11-03T01:14:28.495Z","comments":true,"path":"2018/11/03/瓦力工厂/第1课小猫学步/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/第1课小猫学步/","excerpt":"","text":"当我们已经安装好了软件。此时是全英文的，我们可以点击这个小宇宙切换成简体中文。所以一定要小朋友要好好学英语，这样我们就可以不用切换啦！现在我们来介绍下Scratch软件每个区块的作用和名字，区块名字记不住没关系的，只要知道每个区块是做什么的就可以啦！菜单-是我们保存文件和打开文件的地方； 控制按钮-小绿旗是开始，红色圆圈是停止； 工具箱-可以放大和缩小我们的角色； 舞台区-就是我们动画和游戏展示的地方； 新建角色按钮-我们可以建立我们自己喜欢的角色； 角色列表区-我们可以看到我们有哪些角色； 程序区块-是我们最重要的地方了，我们需要后面慢慢学习； 脚本区-是我们的做的程序。 通过这些枯燥的解释以后，我们就要进入后面的有趣环节了。 一只不会走路的小猫，要小朋友动脑筋来让它学会走路。 我们一起来看看最终我们要做成的样子，一只小猫咪在我们的编程下学会了走路。 是不是太棒啦！！！首先我们添加动作，开始我们编程的第一步，『移动10步』。可是，要不断的点击移动1步，移动1步，小猫咪才会行走，感觉是被老师拖着走的，不是自己在走的，而且老师点击的也有点点累了。老师想让小猫咪自己走起了，不用老师每次去点击一次它才走一步，那么我们就要用一个很关键的程序部分了，那就是重复（循环）。就像我们学习一样要不断的重复才能记住。小猫能一次走很远了，但是好像小猫的动作很不自然，下面我们就让小猫走的自然一点好的这样我们的第一课『小猫学步』就完成了。现在小朋友可以在回到最开始看看我们的做的程序是不是和老师最开始的视频一样的效果。如果不是看看是不是哪里有什么小问题，还是你又改进什么和新发现。可以给老师留言哟！我们一起学习和进步。","categories":[],"tags":[]},{"title":"趣味编程第2课-小猫跳舞","slug":"瓦力工厂/第2课小猫跳舞","date":"2018-11-03T01:14:25.739Z","updated":"2018-11-03T01:14:25.739Z","comments":true,"path":"2018/11/03/瓦力工厂/第2课小猫跳舞/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/第2课小猫跳舞/","excerpt":"","text":"当我们学习了第一课，小猫学步后，对Scratch有了初步的了解，本节课通过小猫跳舞程序的编制，给大家讲解Scratch中，角色的添加与删除，背景的添加与删除。不同角色拥有不同的脚本、背景、声音。下面介紹一下Scratch的各个功能区块。下面添加小猫跳舞的舞台，给小猫一个充分展示才艺的空间小猫有舞台了，下面给小猫添加才艺，把命令积木中的才艺赋给小猫，跳舞、唱歌、弹奏乐器，甚至变脸等等才艺！给小猫添加一个领跳，在美女小姐姐的指挥下，让小猫尽情的跳舞吧！当然，也要给美女小姐姐赋予各种各样的才艺。小猫跳舞就完成了，有什么疑问，加老师微信进行咨询吧！","categories":[],"tags":[]},{"title":"趣味编程第3课-新年到!下雪了","slug":"瓦力工厂/第3课-新年到!下雪了","date":"2018-11-03T01:14:22.795Z","updated":"2018-11-03T01:14:22.795Z","comments":true,"path":"2018/11/03/瓦力工厂/第3课-新年到!下雪了/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/第3课-新年到!下雪了/","excerpt":"","text":"一、任务描述冬天来了,只见雪花纷纷扬扬地从空中飘下来。雪花落在小树上，小树好像穿上雪白的新衣。雪花落在屋顶上，屋顶好像戴上了雪白的帽子。雪花落在大地上，大地好像盖上了雪白的羊毛毯。要求用动画实现下雪的场景。 二、任务目的 1、让大家能够结合我们身边的事物来进行创作，巩固学习编程知识。 2、scratch中克隆体个数是有限的，不能无限制的克隆 3、学习私有变量的创建以及结合克隆体的使用。 4、面对某些不好实现的效果我们需要通过转换思维的办法来解决问题。 三、任务分析 1、初级挑战：只需要会使用克隆与随机数即可。在scratch中“克隆”与“当作为克隆体启动时”经常是配合使用，我们通过重复执行，来不断的克隆雪花。在每个克隆体启动时我们设置一下克隆体的大小和位置，然后再通过重复执行，改变克隆体的y坐标就实现了雪花下落效果。2、中级挑战：要求雪花能够落在屋顶、车、路面。这里只要在雪花下落的过程中增加一个侦测的判断条件，只要克隆体碰到车或房子或者路面（路面用颜色来判断），就停止克隆体移动。 在scratch中克隆体的个数是有限的，你慢慢会发现，雪花会变得越来越少，为了不让雪停下来，我们使用“图章”把克隆的雪花留在舞台上，然后删除克隆体，这样就不会因为克隆体达到上限而停止了。","categories":[],"tags":[]},{"title":"趣味编程第3课-小猫猜生肖","slug":"瓦力工厂/第3课小猫猜生肖","date":"2018-11-03T01:14:19.855Z","updated":"2018-11-03T01:14:19.855Z","comments":true,"path":"2018/11/03/瓦力工厂/第3课小猫猜生肖/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/第3课小猫猜生肖/","excerpt":"","text":"当我们学习了第二课小猫跳舞后，对角色的添加与删除，背景的添加与删除。有了初步的了解，下面我们演示小猫猜生肖案例，对控制、侦测、运算、事件模块进行介绍！这就是小猫猜生肖的基本界面设计，先添加一个背景，然后依次添加角色小猫、老鼠、小狗、猴子…首先,为生肖大师小猫设计脚本：1.用事件中积木开始整个程序。2.用控制中积木开始一个循环。3.用侦测中积木开始一个对话框。并把对话提示语改为“请问你的出生年份是多少？”下面详细的介绍一下小猫是如何知道小朋友的生肖的：大家都知道2018年是狗年，2018除以12的余数是2，那么可以推算出来，能被12整除的年份是猴年，余一的是鸡年、余二的是狗年、依次类推。为什么呢？三年级的小朋友都背过 子鼠、丑牛、寅虎、卯兔的生肖顺口溜吧。就根据咱们已经学到的知识。上图就是咱们经常用到的控制积木中的积木块，是咱们设计的程序的大脑。看这条语句判断你的输入符不符合实际情况。小朋友可能注意到了，否则 后面有两条语句，棕色的广播语句和紫色的说语句。广播语句是用于程序内部通信的，下面给大家展示一下小猴子角色的脚本。是不是和广播的消息遥相呼应。好啦，小猫猜生肖用到的全部知识就介绍完了，想要知道小猫猜生肖的全部脚本或者有不明白的地方，可以联系老师哟！","categories":[],"tags":[]},{"title":"趣味编程第4课-蹦床运动","slug":"瓦力工厂/第4课-蹦床运动","date":"2018-11-03T01:14:17.511Z","updated":"2018-11-03T01:14:17.511Z","comments":true,"path":"2018/11/03/瓦力工厂/第4课-蹦床运动/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/第4课-蹦床运动/","excerpt":"","text":"当我们学习了第三课小猫猜生肖，对对控制、侦测、运算、事件模块有了初步的了解，今天通过蹦床运动介绍 运动 模块的 滑行 、面向 、左右转 和 外观 模块 的 下一个造型、鱼眼特效 等等…今天的程序非常简单，当绿旗被点击时，重复执行并通过 空格键 和 左移键 和 右移键 进行程序的交互，变换出不同的蹦极效果。蹦床的代码为蹦床用到了一个鱼眼特效，变幻出来了动态的效果！想要知道蹦床运动的全部脚本或者有不明白的地方，可以联系老师哟！","categories":[],"tags":[]},{"title":"趣味编程第5课-成语猜猜看","slug":"瓦力工厂/第5课-成语猜猜看","date":"2018-11-03T01:14:14.791Z","updated":"2018-11-03T01:14:14.791Z","comments":true,"path":"2018/11/03/瓦力工厂/第5课-成语猜猜看/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/第5课-成语猜猜看/","excerpt":"","text":"通过第四课的学习，相信小朋友们对 运动、外观 、事件 、侦测 等积木模块有了更深一步的了解。下面通过一款微信上流行的小程序继续向大家介绍 侦测 数据 运算 声音 等积木模块。成语是我国汉字语言词汇中一部分定型的词组和短语。成语有固定的结构形式和固定的说法。表示一定的意义在语句中是作为一个整体来应用的。成语有很大一部分是从古代。形成沿用下来的再用词语方面往往不同与现代汉语。它代表了一个故事和典故。成语又是一种现成的话，跟习用语言语向近也略有区别。主要程序代码如图所示，巧妙地利用角色的造型进行程序图片之间的切换，用链表把成语的图片与意义相关联。答对的话有音乐提示与金币奖励。切换到下一个成语，并且所过的关卡加一。用变量 关名 存储并显示所过的关数，用变量 金钱 来存储并显示所获得的金币数。小朋友，你会做吧，记得加老师微信并与老师互动讨论哟，你还想加入什么你的功能呢？和老师一起进步吧！","categories":[],"tags":[]},{"title":"趣味编程第6课-蜘蛛织网","slug":"瓦力工厂/第6课-蜘蛛织网","date":"2018-11-03T01:14:11.775Z","updated":"2018-11-03T01:14:11.775Z","comments":true,"path":"2018/11/03/瓦力工厂/第6课-蜘蛛织网/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/第6课-蜘蛛织网/","excerpt":"","text":"通过第五课的学习，大家通过一款微信上流行的小程序对 侦测 数据 运算 声音 等积木模块，有了初步的了解，小朋友们是不是更加喜欢编程了呢？下面是蟑螂画彩圆的效果图。下面这幅图，蜘蛛织网，图形很复杂，但是只是非常简单的积木模块。直接上积木模块图，用Scratch画笔功能，可以画各种复杂的图形哟。小朋友，你会做吧，记得加老师微信并与老师互动讨论哟，你还想加入什么你的功能呢？和老师一起进步吧！","categories":[],"tags":[]},{"title":"趣味编程第4课-制作贺卡","slug":"瓦力工厂/趣味编程第4课-制作贺卡","date":"2018-11-03T01:14:08.723Z","updated":"2018-11-03T01:14:08.723Z","comments":true,"path":"2018/11/03/瓦力工厂/趣味编程第4课-制作贺卡/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/趣味编程第4课-制作贺卡/","excerpt":"","text":"新年到了,用Scratch制作一张贺卡,来表达自己的喜悦心情吧!贺卡角色比较多,截图一个角色的程序角色列表","categories":[],"tags":[]},{"title":"儿童编程Scratch 赢在起跑线","slug":"瓦力工厂/Scratch 简介","date":"2018-11-03T01:14:02.559Z","updated":"2018-11-03T01:14:02.559Z","comments":true,"path":"2018/11/03/瓦力工厂/Scratch 简介/","link":"","permalink":"http://yoursite.com/2018/11/03/瓦力工厂/Scratch 简介/","excerpt":"","text":"Scratch是一种全新的程序设计语言，你可以用它很容易地创造交互式故事情节、动画、游戏，然后还可以把你的作品分享给所有人。开发者表示，这种电脑编程语言的目的，是帮助年轻人发展学习技能，学习创造性思维，以及学习集体合作。MIT（麻省理工学院）媒体实验室的博士生凯伦.布雷南，是Scratch项目的负责人，他说，“我们的目的不是要创办电脑程序编写大军，而是帮助电脑使用者表达自己。” 与其让孩子玩游戏；不如让孩子做编程。 Scratch不是游戏，是一款可以制作游戏、动画的编程工具。一旦掌握了这个工具，孩子们就能自由自在地挥洒它们无限的创意，享受创造的乐趣。Scratch由麻省理工学院媒体实验室开发出来至今，全美有超过100万的孩子在学习Scratch。而在台湾，中小学生的信息化课就是以Scratch为主来上的，也有许多Scratch教学的网站。台湾教育部门每年都会举行程序设计比赛。台湾中小学的教育，通过Scratch，扩展了语文，数学，外语，音乐，体育，科学的教学深度。 科技使人类的生活发生巨大的变化。就当下的教育而言，孩子科技能力的重要性绝不亚于其他才艺和知识。 根据孩子上课的情况和效果，我们总结了Scratch三大好处。 1、学习Scratch可以培养逻辑思维能力。在大年龄段孩子学习Scratch编程时，会涉及许多数学知识，孩子需要结合学校内学到的数学知识，来解决编程问题。因此，在不断探索的过程中，孩子们的数学知识也会越累越丰富，创作能力也越来越强。 2、学习Scratch可以提高学习的主动性。在Scratch课堂上，我们鼓励孩子自己创作作品。在创作的过程中不仅习得了Science（科学），Technology（技术），Engineering（工程），Arts（艺术），Maths（数学）等多个领域的知识，而且也获得了成就感和满足感。定期校区举办Scratch分享会，让孩子们彼此体验他们自己编程的游戏，互相提出改进方法方式，这个过程大大激励了孩子的成就感和学习欲望。 3、学习Scratch可以激发创造力。Scratch软件的优势是易学且功能强大，有助于孩子们发挥自己的想象力，而在动手创作过程中，他们的学习积极性、想象力和创造力会得到极大的锻炼。孩子们可以用Scratch中已有的素材，发挥自己的想象力制作游戏、动画，还可以自己设计素材。孩子只要敢想，在我们的指导下，就能完成他们心目中的游戏。 儿童编程和程序员的编程有什么区别？ 归于一句话“孩子编程看兴趣，大人编程看薪水。” 儿童编程使用简易的编程软件进行编程思想和思维方式的锻炼，核心的理念是在把计算机编程融合孩子兴趣的同时，加强孩子思维能力的锻炼，在中国的大多数的儿童编程学习中，均将学科知识与编程知识相融合的方式进行授课教学。这在中国是有一定原因的：传统的中国式教育是以升学为目的的，只有将学科知识融入到编程学习中，家长才会乐于让孩子去接触。而成人的程序编程主要学的是程序语法的应用和实践，他主要偏向的是计算机编程的项目开发。 相对于在学校信息课上所学的知识来说，用于初学者教学，Scratch有以下这些优点： 1、入门简单，无关原有编程基础，适合中小学学生初次学习编程语言时使用； 2、内容丰富，针对有兴趣、喜爱绘画的学生，提供角色绘制设计功能； 3、通过使用Scratch，让学生在动画、游戏设计过程中逐渐形成逻辑分析、独立思考创新的思维方式，学会提出问题，解决问题； 4、相比其他编程软件，Scratch更加直观，学生能比较容易地看到自己的劳动成果。 学习编程最基本的是编程概念的掌握，Scratch以积木的形式进行编程，8个编程部件涵盖了常见的编程概念。学习编程最重要的是编程思想的培养，在程序学习中培养学生利用编程解决问题的能力。 学生在学会了编程的基本原理和方法后，会有兴趣也有能力将动画和游戏编写得更逼真，更好玩。在修改动画游戏脚本的过程中，学生不断提出问题，解决问题，根据自己的需求进行分析，设定合适的角色和相应的脚本，最终实现程序。","categories":[],"tags":[]},{"title":"趣味编程第7课-因数与完美数","slug":"瓦力工厂/第7课-因数与完美数","date":"2018-10-25T07:32:00.622Z","updated":"2018-02-02T01:40:10.105Z","comments":true,"path":"2018/10/25/瓦力工厂/第7课-因数与完美数/","link":"","permalink":"http://yoursite.com/2018/10/25/瓦力工厂/第7课-因数与完美数/","excerpt":"","text":"1&lt;iframe allowtransparency=\"true\" width=\"485\" height=\"402\" src=\"//scratch.mit.edu/projects/embed/196941143/?autostart=false\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;","categories":[],"tags":[]}]}